// 직사각형의 넓이

function solution(rectangles) {
	let answer = -1;

	return answer;
}

// [x1, y1, x2, y2]
// 0 <= x1 < x2 <= 10^9
// 0 <= y1 < y2 <= 10^9
// rect 개수 <= 100,000
// 일반적인 2차원 배열 순회로 접근하면 시간초과 > 털림

// line sweep 하면 되는거같은데 어떻게 적용할까

// res = 14 (= 12 + 4 - 2)
console.log(
	solution([
		[0, 1, 4, 4],
		[3, 1, 5, 3],
	])
);
/*
  0 0 0 0 0 0
  1 1 1 1 1 0
  1 1 1 2 2 1
  1 1 1 2 2 1
  1 1 1 2 2 1
  0 0 0 0 0 0
*/

// res = 38
console.log(
	solution([
		[1, 1, 6, 5],
		[2, 0, 4, 2],
		[2, 4, 5, 7],
		[4, 3, 8, 6],
		[7, 5, 9, 7],
	])
);
